#include "ofApp.h"

//--------------------------------------------------------------
void ofApp::setup(){
    ofBackground(31, 31, 31); //背景色の設定
    ofSetColor(242, 204, 47); //描画色の設定
}

//--------------------------------------------------------------
void ofApp::update(){
    
}

//--------------------------------------------------------------
void ofApp::draw(){
    ofDrawLine(100, 300, 800, 500); //線を描く
    ofDrawRectangle(200, 250, 150, 200); //四角形を描く
    ofDrawCircle(450, 300, 60); //真円を描く
    ofDrawEllipse(550, 500, 200, 100); //楕円を描く
    ofDrawTriangle(700, 200, 550, 400, 750, 380); //三角形を描く
}

//--------------------------------------------------------------
void ofApp::keyPressed(int key){
    
}

//--------------------------------------------------------------
void ofApp::keyReleased(int key){
    
}

//--------------------------------------------------------------
void ofApp::mouseMoved(int x, int y ){
    
}

//--------------------------------------------------------------
void ofApp::mouseDragged(int x, int y, int button){
    
}

//--------------------------------------------------------------
void ofApp::mousePressed(int x, int y, int button){
    
}

//--------------------------------------------------------------
void ofApp::mouseReleased(int x, int y, int button){
    
}

//--------------------------------------------------------------
void ofApp::windowResized(int w, int h){
    
}

