#include "testApp.h"

//--------------------------------------------------------------
void testApp::setup(){
    ofBackground(47, 47, 47); //背景色の設定
}

//--------------------------------------------------------------
void testApp::update(){
    
}

//--------------------------------------------------------------
void testApp::draw(){
    ofSetColor(242, 242, 242); //描画色の設定
    ofLine(100, 300, 800, 500); //線を描く
    ofSetColor(242, 204, 47); //描画色の再設定
    ofRect(200, 250, 150, 200); //四角形を描く
    ofSetColor(174, 221, 60); //描画色の再設定
    ofCircle(450, 300, 60); //真円を描く
    ofSetColor(116, 193, 206); //描画色の再設定
    ofEllipse(550, 500, 200, 100); //楕円を描く
    ofSetColor(211, 24, 24); //描画色の再設定
    ofTriangle(700, 200, 550, 400, 750, 380); //三角形を描く
}

//--------------------------------------------------------------
void testApp::keyPressed(int key){
    
}

//--------------------------------------------------------------
void testApp::keyReleased(int key){
    
}

//--------------------------------------------------------------
void testApp::mouseMoved(int x, int y ){
    
}

//--------------------------------------------------------------
void testApp::mouseDragged(int x, int y, int button){
    
}

//--------------------------------------------------------------
void testApp::mousePressed(int x, int y, int button){
    
}

//--------------------------------------------------------------
void testApp::mouseReleased(int x, int y, int button){
    
}

//--------------------------------------------------------------
void testApp::windowResized(int w, int h){
    
}

