#include "ofApp.h"

//--------------------------------------------------------------
void ofApp::setup(){
    ofBackground(47, 47, 47); //背景色の設定
    ofEnableAlphaBlending(); //透明度(アルファチャンネル)を有効にする
}

//--------------------------------------------------------------
void ofApp::update(){
    
}

//--------------------------------------------------------------
void ofApp::draw(){
    ofSetColor(242, 242, 242, 127); //描画色の設定(アルファ付き)
    ofDrawLine(100, 300, 800, 500); //線を描く
    ofSetColor(242, 204, 47, 127); //描画色の再設定(アルファ付き)
    ofDrawRectangle(200, 250, 200, 300); //四角形を描く
    ofSetColor(174, 221, 60, 127); //描画色の再設定(アルファ付き)
    ofDrawCircle(450, 300, 150); //真円を描く
    ofSetColor(116, 193, 206, 127); //描画色の再設定(アルファ付き)
    ofDrawEllipse(550, 500, 400, 300); //楕円を描く
    ofSetColor(211, 24, 24, 127); //描画色の再設定(アルファ付き)
    ofDrawTriangle(700, 150, 450, 400, 750, 400); //三角形を描く
}

//--------------------------------------------------------------
void ofApp::keyPressed(int key){
    
}

//--------------------------------------------------------------
void ofApp::keyReleased(int key){
    
}

//--------------------------------------------------------------
void ofApp::mouseMoved(int x, int y ){
    
}

//--------------------------------------------------------------
void ofApp::mouseDragged(int x, int y, int button){
    
}

//--------------------------------------------------------------
void ofApp::mousePressed(int x, int y, int button){
    
}

//--------------------------------------------------------------
void ofApp::mouseReleased(int x, int y, int button){
    
}

//--------------------------------------------------------------
void ofApp::windowResized(int w, int h){
    
}

